#___№11___
a = int(input("Введите точку начала отрезка: "))
b = int(input("Введите точку конца отрезка: "))
while a <= b:
    print(2.71 ** a - 1)
    a += 1
#___№12___
a = int(input("Введите точку начала отрезка: "))
b = int(input("Введите точку конца отрезка: "))
while a <= b:
    print(1 / 2 * a)
    a += 1
#___№13___
a = int(input("Введите точку начала отрезка: "))
b = int(input("Введите точку конца отрезка: "))
while a <= b:
    print((a - 1) ** 2)
    a += 1 
#___№14___
a = 1 
b = 20 
while a <= b:
    t = a + 1 
    print(2 * t ** 2 + 2 * t + 2)
    a += 1
#___№15___
a = 2
b = 20 
while a <= b:
    f = 2 * a 
    print(8 * f ** 3 - f)
    a += 2
